{
  "IndexPage": {
    "profesional_description": "I'm Fran, a Software Engineer specializing in building web applications using <strong>JavaScript</strong> and <strong>TypeScript</strong>, with extensive knowledge of technologies like <strong>React, Next.js, Node.js, and Express</strong>. Experienced in managing <strong>SQL</strong> and <strong>NoSQL</strong> databases, and essential knowledge in DevOps such as VPS management, deployments, <strong>Docker</strong>, Linux OS, <strong>AWS</strong>, and <strong>Google Cloud</strong>. I am focused on creating efficient, scalable, and secure solutions, leveraging both backend and frontend technologies to deliver high-quality applications.",
    "experience_title": "Experience",
    "experience": {
      "beder": {
        "title": "Software Engineer",
        "company": "Beder",
        "location": "Barcelona, Espa帽a",
        "date": "Sep 2024 - Present",
        "description": "Development of a B2B platform for airlines, aimed at marketing licensed videos. Frontend built with Next.js and React, and REST API developed with Node.js and Express, managed on Google Cloud and AWS. Automated deployments using CI/CD and Google Gemini AI integration for video analysis. Additionally, maintenance of an app and webapp that allows users to book experiences directly from videos, combining social media inspiration with real-time bookings."
      },
      "trichter_first": {
        "title": "Software Engineer",
        "company": "Trichter Consulting",
        "location": "Playa del Carmen, M茅xico",
        "date": "Jul 2021 - Feb 2022",
        "description": "Collaboration with multidisciplinary teams to implement technological solutions tailored to the real estate sector. Development of scalable REST APIs with Node.js, Express, Prisma and PostgreSQL, and subsequent implementation of GraphQL APIs using NestJS. Integration with third-party APIs to connect real estate portals and CRMs. Creation of frontends with Next.js and React.js, both for clients and internal use, with a focus on dynamic and responsive interfaces. Management and deployment of cloud applications with Vercel, Docker and AWS, guaranteeing scalability and high performance."
      },
      "trichter_second": {
        "title": "Chief Technology Officer",
        "company": "Trichter Consulting",
        "location": "Playa del Carmen, M茅xico",
        "date": "Feb 2022 - Aug 2023",
        "description": "Collaboration with executives to align business needs with strategic technology solutions that support long-term objectives. Leadership of technical team in developing both internal software and custom solutions for clients. Continuous monitoring of deployed systems, resolving issues quickly to minimize downtime and improve operational efficiency."
      },
      "freelance": {
        "title": "Software Developer",
        "company": "Freelance",
        "location": "Argentina",
        "date": "January 2018 - April 2020",
        "description": "Website development and maintenance using WordPress, integrating WooCommerce for eCommerce functionality and Elementor for efficient page layout. Website creation, implementation, and maintenance using JavaScript, HTML, CSS, Sass, and Bootstrap. Management of shared hosting deployments for client projects. Use of Bootstrap and Sass to create responsive and visually appealing web interfaces."
      }
    },
    "buttons": {
      "read_more": "Read more",
      "read_less": "Read less",
      "download_cv": {
        "text": "Download CV",
        "link": "https://drive.google.com/file/d/1ZtvQFKe0TLPBHKja2TH_0tgFXJiBfKh6/view?usp=drive_link"
      }
    },
    "projects_title": "Projects",
    "projects": {
      "nodeverses": {
        "title": "Nodeverses",
        "description": "A flexible Node.js framework for building scalable applications with ready-to-use architectures and design patterns, speeding up project setup ",
        "type_of_participation": "Creator",
        "link": "https://github.com/nodeverses"
      },
      "whatMLmodel": {
        "title": "WhatMLModel",
        "description": "A web application that uses AI to identify the most suitable machine learning model for your dataset, based on the nature of the data and the problem to be solved ",
        "type_of_participation": "Contributor",
        "link": "https://github.com/facundochavez/whatMLmodel"
      },
      "namviek": {
        "title": "Namviek",
        "description": "An open-source project management tool for small teams with a low budget. Includes essential features to manage your team.",
        "type_of_participation": "Contributor",
        "link": "https://github.com/hudy9x/namviek"
      },
      "summe": {
        "title": "Summe",
        "description": "An open-source article summarization application that transforms long articles into clear and concise summaries.",
        "type_of_participation": "Creator",
        "link": "https://github.com/FranciscoJBrito/summarizer-ai"
      }
    },
    "posts": {
      "first": {
        "title": "Authentication and Authorization with Node.js, Express, JWT and Next.js",
        "subtitle": "Part 1: Introduction to the Basics",
        "link": "https://medium.com/@francisco.brito.developer/autenticaci贸n-y-autorizaci贸n-con-node-js-express-jwt-y-next-js-parte-1-062cb533545c"
      },
      "second": {
        "title": "Authentication and Authorization with Node.js, Express, JWT and Next.js",
        "subtitle": "Part 2: Project Setup",
        "link": "https://medium.com/@francisco.brito.developer/autenticaci贸n-y-autorizaci贸n-con-node-js-express-jwt-y-next-js-e76965be7246"
      },
      "third": {
        "title": "Authentication and Authorization with Node.js, Express, JWT and Next.js",
        "subtitle": "Part 3: Backend authentication",
        "link": "https://medium.com/@francisco.brito.developer/autenticaci贸n-y-autorizaci贸n-con-node-js-express-jwt-y-next-js-a96165cd32d5"
      }
    },
    "footer": {
      "text": "Francisco Brito - 2024"
    }
  }
}
