{
  "IndexPage": {
    "profesional_description": "Soy Fran, un Desarrollador de software especializado en la creaci贸n de aplicaciones web con <strong>JavaScript</strong> y <strong>TypeScript</strong>, con amplios conocimientos de tecnolog铆as como <strong>React, Next.js, Node.js y Express</strong>. Experiencia en la gesti贸n de bases de datos <strong>SQL</strong> y <strong>NoSQL</strong>, y conocimientos esenciales en DevOps como gesti贸n de VPS, despliegues, <strong>Docker</strong>, SO Linux, <strong>AWS</strong> y <strong>Google Cloud</strong>. Me centro en crear soluciones eficientes, escalables y seguras, en backend y frontend para ofrecer aplicaciones de calidad.",
    "experience_title": "Experiencia",
    "experience": {
      "beder": {
        "title": "Software Engineer",
        "company": "Beder",
        "location": "Barcelona, Espa帽a",
        "date": "Sep 2024 - Presente",
        "description": "Desarrollo de plataforma B2B para aerol铆neas, destinada a la comercializaci贸n de videos bajo licencia. Frontend construido con Next.js y React, y API REST desarrollada con Node.js y Express, gestionada en Google Cloud y AWS. Despliegues automatizados mediante CI/CD e integraci贸n de IA Google Gemini para an谩lisis de video. Adem谩s, mantenimiento de una app y webapp que permite a los usuarios reservar experiencias directamente desde los videos, combinando la inspiraci贸n de redes sociales con reservas en tiempo real."
      },
      "trichter_first": {
        "title": "Software Engineer",
        "company": "Trichter Consulting",
        "location": "Playa del Carmen, M茅xico",
        "date": "Julio 2021 - Feb 2022",
        "description": "Colaboraci贸n con equipos multidisciplinarios para implementar soluciones tecnol贸gicas adaptadas al sector inmobiliario. Desarrollo de REST API escalables con Node.js, Express, Prisma y PostgreSQL, y posterior implementaci贸n de GraphQL API utilizando NestJS. Integraci贸n con APIs de terceros para conectar portales inmobiliarios y CRMs. Creaci贸n de frontend con Next.js y React.js, tanto para clientes como para uso interno, con un enfoque en interfaces din谩micas y responsivas. Gesti贸n y despliegue de aplicaciones en la nube con Vercel, Docker y AWS, garantizando escalabilidad y alto rendimiento."
      },
      "trichter_second": {
        "title": "CTO - Director de tecnolog铆a",
        "company": "Trichter Consulting",
        "location": "Playa del Carmen, M茅xico",
        "date": "Feb 2022 - Ago 2023",
        "description": "Colaboraci贸n con los directivos para alinear las necesidades empresariales con soluciones tecnol贸gicas estrat茅gicas que apoyen los objetivos a largo plazo. Liderazgo del equipo t茅cnico en el desarrollo de software interno y soluciones personalizadas para clientes. Supervisi贸n continua de sistemas implementados, resolviendo problemas r谩pidamente para minimizar tiempos de inactividad y mejorar la eficiencia operativa."
      },
      "freelance": {
        "title": "Software Developer",
        "company": "Freelance",
        "location": "Argentina",
        "date": "Enero 2018 - Abril 2020",
        "description": "Desarrollo y mantenimiento de sitios web utilizando WordPress, integrando WooCommerce para funcionalidades de comercio electr贸nico y Elementor para dise帽o de p谩ginas eficiente. Creaci贸n, implementaci贸n y mantenimiento de sitios web con JavaScript, HTML, CSS, Sass y Bootstrap. Gesti贸n de despliegues en hosting compartidos para proyectos de clientes. Uso de Bootstrap y Sass para crear interfaces web responsivas y visualmente atractivas."
      }
    },
    "buttons": {
      "read_more": "Leer m谩s",
      "read_less": "Leer menos"
    },
    "projects": {
      "nodeverses": {
        "title": "Nodeverses",
        "description": "Un framework de Node.js flexible para crear aplicaciones escalables con arquitecturas y patrones de dise帽o listos para usar, acelerando la configuraci贸n del proyecto ",
        "type_of_participation": "Creador",
        "link": "https://github.com/nodeverses"
      },
      "whatMLmodel": {
        "title": "WhatMLModel",
        "description": "Una aplicaci贸n web que usa IA para identificar el modelo de aprendizaje autom谩tico m谩s adecuado para tu conjunto de datos, basado en la naturaleza de los datos y el problema a resolver ",
        "type_of_participation": "Colaborador",
        "link": "https://github.com/facundochavez/whatMLmodel"
      },
      "namviek": {
        "title": "Namviek",
        "description": "Un gestor de proyectos de c贸digo abierto para equipos peque帽os con bajo presupuesto. Incluye funciones esenciales para gestionar tu equipo.",
        "type_of_participation": "Colaborador",
        "link": "https://github.com/hudy9x/namviek"
      },
      "summe": {
        "title": "Summe",
        "description": "Una aplicaci贸n para resumen de art铆culos de c贸digo abierto que transforma art铆culos largos en res煤menes claros y concisos.",
        "type_of_participation": "Creador",
        "link": "https://github.com/FranciscoJBrito/summarizer-ai"
      }
    },
    "posts": {
      "first": {
        "title": "Autenticaci贸n y Autorizaci贸n con Node.js, Express, JWT y Next.js",
        "subtitle": "Parte 1: Introducci贸n a los Conceptos B谩sicos",
        "link": "https://medium.com/@francisco.brito.developer/autenticaci贸n-y-autorizaci贸n-con-node-js-express-jwt-y-next-js-parte-1-062cb533545c"
      },
      "second": {
        "title": "Autenticaci贸n y Autorizaci贸n con Node.js, Express, JWT y Next.js",
        "subtitle": "Parte 2: Configuraci贸n del proyecto",
        "link": "https://medium.com/@francisco.brito.developer/autenticaci贸n-y-autorizaci贸n-con-node-js-express-jwt-y-next-js-e76965be7246"
      }
    },
    "footer": {
      "text": "Francisco Brito - 2024"
    }
  }
}
